app/Http/Controllers/Api/BlogHeadController.php

insert into `blog_heads` (`titulo`, `texto_frase`, `texto_descripcion`) values ('Blog de prueba 444', 'Esta es una frase de prueba para verificar el borrado', 'Descripcion de prueba para el blog head que estamos creando para verificar las funcionalidades de soft delete')
---
    public function create(Request $request)
    {
        try{
            $validator = Validator::make($request->all(), [
                'titulo' => 'required|string|max:50',
                'texto_frase' => 'required|string|max:70',
                'texto_descripcion' => 'required|string|max:120',
                'public_image' => 'required|string',
                'url_image' => 'nullable|string',
                'alt'=> 'nullable|string|min:60|max:120',
                'title'=> 'nullable|string|min:50|max:70',
                'meta_title'=> 'nullable|string|min:50|max:60',
                'meta_descripcion'=> 'nullable|string|min:150|max:160'
            ]);

            if ($validator->fails()) {
                return response()->json(['errors' => $validator->errors()], 400);
            }

            DB::beginTransaction();

            $blogHead = BlogHead::create($request->all());