app/Http/Controllers/Api/BlogBodyController.php


            DB::beginTransaction();

            $blogBody = BlogBody::create($request->all());
---
insert into `blog_bodies` (`titulo`, `descripcion`, `id_commend_tarjeta`, `flag_galeria`, `flag_consejos`, `flag_informacion`) values ('Contenido del blog de prueba', 'Este es el contenido principal del blog que usaremos para probar soft delete y force delete', 2, 0, 1, 0)