app/Http/Controllers/Api/BlogFooterController.php

    public function create(Request $request)
    {
        try{
            $validator = Validator::make($request->all(), [
                'titulo' => 'required|string|max:255',
                'descripcion' => 'required|string',
                'public_image1' => 'required|string',
                'url_image1' => 'nullable|string',
                'public_image2' => 'required|string',
                'url_image2' => 'nullable|string',
                'public_image3' => 'required|string',
                'url_image3' => 'nullable|string',
                'alt_image1' => 'nullable|string',
                'title_image1' => 'nullable|string',
                'alt_image2' => 'nullable|string',
                'title_image2' => 'nullable|string',
                'alt_image3' => 'nullable|string',
                'title_image3' => 'nullable|string',
                'estado' => 'nullable|boolean',
            ]);

            if ($validator->fails()) {
                return response()->json(['errors' => $validator->errors()], 400);
            }

            DB::beginTransaction();

            $blogFooter = BlogFooter::create($request->all());
---
insert into `blog_footers` (`titulo`, `descripcion`) values ('Footer del blog de prueba', 'Este es el pie del blog de prueba para verificar eliminacion')