app/Http/Controllers/Api/CommendTarjetaController.php

    public function create(StoreCommendTarjetaRequest $request)
    {
        try {

            DB::beginTransaction();

            $commendTarjeta = CommendTarjeta::create($request->all());
---
insert into `commend_tarjetas` (`titulo`, `texto1`, `texto2`, `texto3`) values ('Recomendaciones de prueba', 'Consejo numero uno de prueba', 'Consejo numero dos de prueba', 'Consejo numero tres de prueba')